In [1]:
import mysql.connector as conn

In [2]:
mydb = conn.connect(host='localhost', user='root', password='Mychoice.77')

In [3]:
mydb

In [4]:
cursor = mydb.cursor()

In [5]:
# url = 'create database org'
# cursor.execute(url)

In [6]:
url = 'show databases'
cursor.execute(url)
cursor.fetchall()

[('cardataset',),
 ('employee',),
 ('fifa19',),
 ('in_class',),
 ('information_schema',),
 ('mysql',),
 ('new_db',),
 ('org',),
 ('performance_schema',),
 ('sakila',),
 ('student',),
 ('sys',),
 ('world',)]

In [7]:
url = 'use org'
cursor.execute(url)

In [8]:
# url = '''create table worker(
# worker_id int(10), 
# first_name varchar(10), 
# last_name varchar(10), 
# salary int(10), 
# joining_date datetime,
# department varchar(10))''' 

# cursor.execute(url)

In [9]:
url = '''show tables'''
cursor.execute(url)
cursor.fetchall()

[('worker',)]

In [10]:
url = '''INSERT INTO worker 
	(worker_id, first_name, last_name, salary, joining_date, department) VALUES
		(001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
		(002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
		(003, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
		(004, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
		(005, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
		(006, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
		(007, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
		(008, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');'''

cursor.execute(url)
mydb.commit()

In [11]:
url = '''select * from worker''' 

cursor.execute(url) 
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin'),
 (1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin')]

In [12]:
url = '''alter table worker 
rename column worker_id to WORKER_ID, 
rename column first_name to FIRST_NAME, 
rename column last_name to LAST_NAME, 
rename column salary to SALARY, 
rename column joining_date to JOINING_DATE, 
rename column department to DEPARTMENT'''

cursor.execute(url)

In [13]:
import pandas as pd 

url = '''select * from worker'''
pd.read_sql(url, mydb, index_col=None)

C:\Users\ipawa\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0           1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1           2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2           3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3           4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4           5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
5           6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6           7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
7           8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin
8           1     Monika     Arora  100000 2014-02-20 09:00:00         HR
9           2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
10          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
11          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
12          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
13          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
14          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
15          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

# Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as WORKER_NAME

In [14]:
url = '''
SELECT FIRST_NAME AS WORKER_NAME 
FROM WORKER'''

pd.read_sql(url, mydb)

C:\Users\ipawa\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   WORKER_NAME
0       Monika
1     Niharika
2       Vishal
3      Amitabh
4        Vivek
5        Vipul
6       Satish
7      Geetika
8       Monika
9     Niharika
10      Vishal
11     Amitabh
12       Vivek
13       Vipul
14      Satish
15     Geetika

# Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [15]:
url = '''
select distinct(DEPARTMENT) 
FROM worker
'''

pd.read_sql(url, mydb)

C:\Users\ipawa\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  DEPARTMENT
0         HR
1      Admin
2    Account

# Write an SQL query to show the last 5 record from a table.

In [16]:
url = '''
select * from worker
order by WORKER_ID desc
limit 5''' 

pd.read_sql(url, mydb)

C:\Users\ipawa\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin
1          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin
2          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
3          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
4          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account

In [17]:
mydb.commit

# Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [19]:
url = '''select substring(FIRST_NAME, 1, 3) from worker'''
pd.read_sql(url, mydb)

C:\Users\ipawa\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   substring(FIRST_NAME, 1, 3)
0                          Mon
1                          Nih
2                          Vis
3                          Ami
4                          Viv
5                          Vip
6                          Sat
7                          Gee
8                          Mon
9                          Nih
10                         Vis
11                         Ami
12                         Viv
13                         Vip
14                         Sat
15                         Gee

# Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [23]:
# instr is case insensitive, using binary makes it case insensitive 
url = """select FIRST_NAME, instr(FIRST_NAME, binary'a') as POSITION
         from worker
         where FIRST_NAME = 'Amitabh'"""
pd.read_sql(url, mydb)

C:\Users\ipawa\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  FIRST_NAME  POSITION
0    Amitabh         1
1    Amitabh         1

# Write an SQL query to print the name of employees having the highest salary in each department.

In [21]:
url = '''select DEPARTMENT, SALARY as HIGHEST_SALARY
         from worker
         group by DEPARTMENT''' 
pd.read_sql(url, mydb)

  DEPARTMENT  HIGHEST_SALARY
0         HR          100000
1      Admin           80000
2    Account          200000